src/InformationRegisters/СогласованияСтраховыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СогласованияСтраховыхУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияСтраховыхУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки на согласование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Врач</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Comment>Когда согласовали</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласователь</Name>
					<Comment>Кто согласовал</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Зуб</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОповещениеМониторингКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОповещениеМониторингКлиента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Старт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОкна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр_5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектОповещения</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыСогласованияСтраховыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСогласованияСтраховыхУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/СогласованияСтраховыхУслуг/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	Элементы.ГруппаВыборИнтервалаЗаписи.Доступность = РольДоступна("СогласованиеСтраховыхУслуг");
	
	ЭтотОбъект.СтатусОтбор = Перечисления.СтатусыСогласованияСтраховыхУслуг.ОжидаетСогласования;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтатусСогласования", ЭтотОбъект.СтатусОтбор, Истина);	
	
	ИспользоватьСистемуВзаимодействия = ОбсужденияСистемыВзаимодействия.СистемаВзаимодействияВключена();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события таблицы формы "СписокПриАктивизацииСтроки".
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеСписка = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанныеСписка <> Неопределено Тогда 
		
		Если ТекущиеДанныеСписка.РодительскаяГруппировкаСтроки <> Неопределено Тогда
			ЭтотОбъект.СтатусСогласования = ТекущиеДанныеСписка.СтатусСогласования;
		Иначе
			ЭтотОбъект.СтатусСогласования =	Неопределено;
		КонецЕсли;
		
		УстановитьАктивностьТумблеров();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события элемента формы "СтатусОтборПриИзменении".
//
Процедура СтатусОтборПриИзменении(Элемент)
	
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтатусСогласования", ЭтотОбъект.СтатусОтбор, ЗначениеЗаполнено(ЭтотОбъект.СтатусОтбор));  
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события таблицы "СписокВыбор".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки) Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСогласованияЗавершение", ЭтотОбъект, Элемент.ТекущиеДанные.ИдентификаторСтроки); // Не убирать видидомость ИдентификаторСтроки. Это единственный реквизит для идентификации.
			
			ПараметрыФормы = ПолучитьСтруктуруСтроки(Элемент.ТекущиеДанные);
			ОткрытьФорму("РегистрСведений.СогласованияСтраховыхУслуг.Форма.ФормаСогласования", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			ОповеститьОбИзменении(Элемент.ТекущаяСтрока);
			
		Иначе
			ПоказатьЗначение(,Элемент.ТекущиеДанные.Прием); 
		КонецЕсли;	
 	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды формы "ИзменитьСтатусСогласования".
//
Процедура ИзменитьСтатусСогласования(Команда)
			
	НеактивныеЭлементы = Новый Массив;
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОжидает);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусСогласован);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОтказ);
	
	Если ТекущийЭлемент.Имя = "УстановитьСтатусОжидает" Тогда
		
		ЭтотОбъект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияСтраховыхУслуг.ОжидаетСогласования");
		АктивныйЭлемент = Элементы.ГруппаСтатусОжидает;
		
	ИначеЕсли ТекущийЭлемент.Имя = "УстановитьСтатусСогласован" Тогда
		
		ЭтотОбъект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияСтраховыхУслуг.Согласован");
		АктивныйЭлемент = Элементы.ГруппаСтатусСогласован;
		
	ИначеЕсли ТекущийЭлемент.Имя = "УстановитьСтатусОтказ" Тогда
		
		ЭтотОбъект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияСтраховыхУслуг.Отказ");
		АктивныйЭлемент = Элементы.ГруппаСтатусОтказ;
		
	КонецЕсли;
	
	ИндексЭлемента = НеактивныеЭлементы.Найти(АктивныйЭлемент);
	Если ИндексЭлемента <> Неопределено Тогда
		НеактивныеЭлементы.Удалить(ИндексЭлемента);
	КонецЕсли;
	
	ТекущиеДанныеСписка = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанныеСписка <> Неопределено Тогда 
		
		Если ТекущиеДанныеСписка.РодительскаяГруппировкаСтроки <> Неопределено Тогда
			
			ОбновитьЗаписьРегистра(Элементы.Список.ТекущаяСтрока, ЭтотОбъект.СтатусСогласования);
			ОповеститьОбИзменении(Элементы.Список.ТекущаяСтрока); 	
			ОповеститьОткрытыеФормы(ТекущиеДанныеСписка.ИдентификаторСтроки,,ТекущиеДанныеСписка.СтруктурнаяЕдиница);
			
		Иначе                                 
			
			ОбновитьЗаписиРегистраПоПриему(Элементы.Список.ТекущаяСтрока.Ключ);
			Элементы.Список.Обновить();
			ОповеститьОткрытыеФормы(,Элементы.Список.ТекущаяСтрока.Ключ); 
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Обязательно выполняется сначала запись, потом изменение тумблера.
	// Т.к. текущая строка переходит в неопределено.
	ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныеЭлементы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Обновить запись регистра.
//
Процедура ОбновитьЗаписьРегистра(КлючЗаписи, знач СтатусСогласования, КомментарийСогласования = "")

	МенеджерЗаписи = РегистрыСведений.СогласованияСтраховыхУслуг.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписи); 
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.СтатусСогласования 	= СтатусСогласования;
	МенеджерЗаписи.Согласователь 		= ЭтотОбъект.ТекущийСотрудник;
	МенеджерЗаписи.ДатаСогласования 	= ТекущаяДатаСеанса();
	МенеджерЗаписи.Комментарий 			= КомментарийСогласования;
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить записи регистра по приему.
//
Процедура ОбновитьЗаписиРегистраПоПриему(знач Прием)

	НаборЗаписей = РегистрыСведений.СогласованияСтраховыхУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Прием.Установить(Прием);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Для каждого ЗаписьНабора Из НаборЗаписей Цикл
			
			ЗаписьНабора.СтатусСогласования = СтатусСогласования;
			ЗаписьНабора.Согласователь = ЭтотОбъект.ТекущийСотрудник;
			ЗаписьНабора.ДатаСогласования = ТекущаяДатаСеанса();	
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры                         

&НаСервереБезКонтекста
// Функция - Получить структуру строки.
//
Функция ПолучитьСтруктуруСтроки(знач ДанныеФормыСтрока)
	          
	СтруктураПараметров = Новый Структура("СтруктурнаяЕдиница, Прием, ИдентификаторСтроки, Договор, Номенклатура, 
											|Контрагент, СтраховаяКомпания, Зуб, СтатусСогласования, 
											|ДатаОтправки, Ответственный, ДатаСогласования, Согласователь, Комментарий");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ДанныеФормыСтрока);

	СтруктураПараметров.Вставить("РежимРедактировать", Истина);
	
	Возврат СтруктураПараметров;

КонецФункции

&НаКлиенте
// Процедура - Оповестить открытые формы.
//
Процедура ОповеститьОткрытыеФормы(ИдентификаторСтроки = Неопределено, ИзмененныйПрием = Неопределено, СтруктурнаяЕдиница = Неопределено)
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	ПараметрыОповещения.Вставить("ИзмененныйПрием", ОбсужденияСистемыВзаимодействия.ПроверитьЗаполненностьЭлемента(ИзмененныйПрием));
		
	ОповеситьНаСервере(ПараметрыОповещения, СтруктурнаяЕдиница);
	
КонецПроцедуры

&НаСервере
// Процедура - Оповесить на сервере.
//
Процедура ОповеситьНаСервере(Знач ПараметрыОповещения, СтруктурнаяЕдиница)

	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница)
		И ЗначениеЗаполнено(ПараметрыОповещения.ИзмененныйПрием) Тогда
		
		СтруктурнаяЕдиница = ПараметрыОповещения.ИзмененныйПрием.СтруктурнаяЕдиница;	
	КонецЕсли;
	
	ТекущиеСеансы = ПолучитьСеансыИнформационнойБазы();
	
	МассивСеансов 					  = Новый Массив;
	ПользователиОповещения 			  = Новый Массив;

	МассивПараметров = Новый Массив(); 
	Для каждого ЭлементСтруктуры Из ПараметрыОповещения Цикл
		МассивПараметров.Добавить(ЭлементСтруктуры.Значение);
	КонецЦикла;
	
	Для Каждого ТекущийСеанс Из ТекущиеСеансы Цикл
		
		Если ТекущийСеанс.ИмяПриложения = "1CV8C"
			ИЛИ ТекущийСеанс.ИмяПриложения = "WebClient" Тогда
			
			Если ИспользоватьСистемуВзаимодействия = Истина Тогда
				
				// Получаем сеансы, которые необходимо оповестить.
				МассивСеансов.Добавить(ТекущийСеанс.НомерСеанса);
				ПользователиОповещения.Добавить(ТекущийСеанс.Пользователь);
				
			Иначе	
								
				// Создаем оповещение через регистр сведений.
				РегистрыСведений.ОповещениеМониторингКлиента.ДобавитьОповещениеКлиента(ТекущийСеанс.НомерСеанса,
				СтруктурнаяЕдиница,
				"ОбновитьСогласованияСтраховыхУслуг_" + Новый УникальныйИдентификатор(),
				ТекущаяДатаСеанса(), 
				60,,,
				МассивПараметров);  
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ИспользоватьСистемуВзаимодействия = Истина
		И ПользователиОповещения.Количество() > 0 Тогда
		
		// Создаем оповещение через систему взаимодействия.
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("Ключ", "ОбновитьСогласованияСтраховыхУслуг");
		ДанныеСообщения.Вставить("ПараметрыОповещения", ПараметрыОповещения);
		
		ОбсужденияСистемыВзаимодействия.ДобавитьСообщениеВСистемуВзаимодействия(ДанныеСообщения,, ПользователиОповещения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Выбор согласования завершение.
//
Процедура ВыборСогласованияЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(ДопПараметры)
		И Результат <> Неопределено Тогда 
		
		ОповеститьОткрытыеФормы(ДопПараметры,,Элементы.Список.ТекущиеДанные.СтруктурнаяЕдиница);
		ОбновитьЗаписьРегистра(Элементы.Список.ТекущаяСтрока, Результат.СтатусСогласования, Результат.КомментарийСогласования); 
		ОповеститьОбИзменении(Элементы.Список.ТекущаяСтрока); 
		
	КонецЕсли;	
	
КонецПроцедуры

 &НаКлиенте
// Процедура, изменяет видимость групп переключателей.
//
Процедура ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент = Неопределено, НеактивныйЭлемент = Неопределено, Активировать = Истина)
	
	УправлениеИнтерфейсамиКлиент.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, Активировать, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
// Процедура, изменяет видимость групп переключателей.
//
Процедура ИзменитьАктивностьПереключателяФормыНаСервере(АктивныйЭлемент = Неопределено, НеактивныйЭлемент = Неопределено, Активировать = Истина)
	
	УправлениеИнтерфейсамиСервер.ИзменитьАктивностьПереключателяФормы(АктивныйЭлемент, НеактивныйЭлемент, Активировать, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает активность тумблеров.
//
Процедура УстановитьАктивностьТумблеров()
	
	НеактивныеЭлементы = Новый Массив;
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОжидает);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусСогласован);
	НеактивныеЭлементы.Добавить(Элементы.ГруппаСтатусОтказ);

	Если ЭтотОбъект.СтатусСогласования = Перечисления.СтатусыСогласованияСтраховыхУслуг.Согласован Тогда
		АктивныйЭлемент = Элементы.ГруппаСтатусСогласован;
	ИначеЕсли ЭтотОбъект.СтатусСогласования = Перечисления.СтатусыСогласованияСтраховыхУслуг.Отказ Тогда
		АктивныйЭлемент = Элементы.ГруппаСтатусОтказ;
	ИначеЕсли ЭтотОбъект.СтатусСогласования = Перечисления.СтатусыСогласованияСтраховыхУслуг.ОжидаетСогласования Тогда
		АктивныйЭлемент = Элементы.ГруппаСтатусОжидает;
	Иначе 
		АктивныйЭлемент = Неопределено;
	КонецЕсли;
	
	ИндексЭлемента = НеактивныеЭлементы.Найти(АктивныйЭлемент);
	Если ИндексЭлемента <> Неопределено Тогда
		НеактивныеЭлементы.Удалить(ИндексЭлемента);
	КонецЕсли;
	
	ИзменитьАктивностьПереключателяФормыНаСервере(АктивныйЭлемент, НеактивныеЭлементы);
		
КонецПроцедуры


#КонецОбласти
